In [1]:
import pandas as pd

In [3]:
data=[1,2,3,4,5]
series=pd.Series(data)

In [5]:
series
type(series)

pandas.core.series.Series

In [7]:
#creating series from dictionary
data={"a":1,"b":2,"c":3}
seies_dic=pd.Series(data)

In [8]:
seies_dic

a    1
b    2
c    3
dtype: int64

In [9]:
type(seies_dic)

pandas.core.series.Series

In [11]:
data=[10,20,30,40,50]
indexes=["apple","banana","cherry","dog","elephant"]
pd.Series(data,index=indexes)

apple       10
banana      20
cherry      30
dog         40
elephant    50
dtype: int64

In [14]:
#DataFrame
#creating a dataframe using dictionary of list
data={
    "Name":["krishn","Brahme","Vishnu","Eshwar"],
    "Age":[20,30,40,50],
    "City":["Banglore","Mumbai","New York","Florida"]

}
df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age      City
0  krishn   20  Banglore
1  Brahme   30    Mumbai
2  Vishnu   40  New York
3  Eshwar   50   Florida
<class 'pandas.core.frame.DataFrame'>

In [15]:
#Converting into array
import numpy as np
arr=np.array(df)

In [16]:
arr

array([['krishn', 20, 'Banglore'],
       ['Brahme', 30, 'Mumbai'],
       ['Vishnu', 40, 'New York'],
       ['Eshwar', 50, 'Florida']], dtype=object)

In [17]:
len(arr)

4

In [18]:
arr[0]

array(['krishn', 20, 'Banglore'], dtype=object)

In [21]:
df

     Name  Age      City
0  krishn   20  Banglore
1  Brahme   30    Mumbai
2  Vishnu   40  New York
3  Eshwar   50   Florida

In [22]:
##Creating a Data Frame from list of Dictionaries
data=[
    {"Name":"Brahme","Age":20},
    {"Name":"Vishnu","Age":25},
    {"Name":"Eshwar","Age":23},
    {"Name":"Ram","Age":27}
]
df1=pd.DataFrame(data)

In [23]:
df1

     Name  Age
0  Brahme   20
1  Vishnu   25
2  Eshwar   23
3     Ram   27

In [25]:
df=pd.read_csv("data.csv")

In [26]:
df.head()

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [27]:
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [28]:
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [29]:
len(df)

50

In [30]:
#Accessing data from dataframe

In [31]:
df1

     Name  Age
0  Brahme   20
1  Vishnu   25
2  Eshwar   23
3     Ram   27

In [32]:
df1["Name"]

0    Brahme
1    Vishnu
2    Eshwar
3       Ram
Name: Name, dtype: object

In [33]:
type(df1["Name"])

pandas.core.series.Series

In [34]:
df1.Name

0    Brahme
1    Vishnu
2    Eshwar
3       Ram
Name: Name, dtype: object

In [35]:
df1.loc[0]

Name    Brahme
Age         20
Name: 0, dtype: object

In [36]:
import pandas as pd

# Creating a sample DataFrame
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data, index=['x', 'y', 'z'])

# Using .loc (label-based)
print(df.loc['x', 'A'])  # Output: 1

# Using .iloc (integer-location based)
print(df.iloc[0, 0])     # Output: 1

1
1

In [ ]:
'''
.loc: Mainly deals with labels (row/column names).
.iloc: Used for index-based selection (position of rows/columns).
'''

In [37]:
df

   A  B
x  1  4
y  2  5
z  3  6

In [38]:
import pandas as pd

# Sample DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data, index=['a', 'b', 'c'])

# Using .loc (label-based selection)
# Select row with label 'a' and columns 'Name' and 'Age'
print(df.loc['a', ['Name', 'Age']])
# Output:
# Name    Alice
# Age        25
# Name: a, dtype: object

# Using .iloc (index-based selection)
# Select the first row and the first two columns
print(df.iloc[0, [0, 1]])
# Output:
# Name    Alice
# Age        25
# Name: a, dtype: object

Name    Alice
Age        25
Name: a, dtype: object
Name    Alice
Age        25
Name: a, dtype: object

In [39]:
#Accessing a specified location

In [40]:
df

      Name  Age         City
a    Alice   25     New York
b      Bob   30  Los Angeles
c  Charlie   35      Chicago

In [42]:
print(df.at["a","Age"])

25

In [43]:
print(df.at["b","City"])

Los Angeles

In [44]:
df

      Name  Age         City
a    Alice   25     New York
b      Bob   30  Los Angeles
c  Charlie   35      Chicago

In [45]:
df.iat[2,2]

'Chicago'

In [46]:
#Data Manipulation with DataFrames
df

      Name  Age         City
a    Alice   25     New York
b      Bob   30  Los Angeles
c  Charlie   35      Chicago

In [49]:
#adding a column
df["Salary"]=[50000,60000,65000]

In [50]:
df

      Name  Age         City  Salary
a    Alice   25     New York   50000
b      Bob   30  Los Angeles   60000
c  Charlie   35      Chicago   65000

In [51]:
df.drop("Salary",axis=1)

      Name  Age         City
a    Alice   25     New York
b      Bob   30  Los Angeles
c  Charlie   35      Chicago

In [52]:
df

      Name  Age         City  Salary
a    Alice   25     New York   50000
b      Bob   30  Los Angeles   60000
c  Charlie   35      Chicago   65000

In [53]:
df.drop("a")

      Name  Age         City  Salary
b      Bob   30  Los Angeles   60000
c  Charlie   35      Chicago   65000

In [54]:
df

      Name  Age         City  Salary
a    Alice   25     New York   50000
b      Bob   30  Los Angeles   60000
c  Charlie   35      Chicago   65000

In [55]:
df.drop("Salary",axis=1,inplace=True)

In [56]:
df

      Name  Age         City
a    Alice   25     New York
b      Bob   30  Los Angeles
c  Charlie   35      Chicago

In [57]:
df["Age"]+1

a    26
b    31
c    36
Name: Age, dtype: int64

In [58]:
df

      Name  Age         City
a    Alice   25     New York
b      Bob   30  Los Angeles
c  Charlie   35      Chicago

In [59]:
df["Age"]=df["Age"]+1

In [60]:
df

      Name  Age         City
a    Alice   26     New York
b      Bob   31  Los Angeles
c  Charlie   36      Chicago

In [61]:
df.drop("a",inplace=True)

In [62]:
df

      Name  Age         City
b      Bob   31  Los Angeles
c  Charlie   36      Chicago

In [63]:
df.dtypes

Name    object
Age      int64
City    object
dtype: object

In [66]:
df.describe()

             Age
count   2.000000
mean   33.500000
std     3.535534
min    31.000000
25%    32.250000
50%    33.500000
75%    34.750000
max    36.000000

In [67]:
df

      Name  Age         City
b      Bob   31  Los Angeles
c  Charlie   36      Chicago